tps/table_num_delay_0.txt
Script started on 2026-02-20 16:26:14+09:00 [TERM="tmux-256color" TTY="/dev/pts/2" COLUMNS="229" LINES="65"]
1024

%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🦔 ~/mysql_test/tps @ann🦔 
$> =eecho '   e  eecho 'use 10 table'5 table' 21innodb_spin_wait_delay:6, innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'

%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🐼 ~/mysql_test/tps @ann🐬 
$> =eecho 'use 10 table'5 table' 21innodb_spin_wait_delay:6, innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'compare the number of tables[1,2,5,10]'                                                  >

kecho\compare the number of tables[1,2,5,10]
%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🐐 ~/mysql_test/tps @ann🐳 
$> =eecho 'compare the number of tables[1,2,5,10]'use 10 table'                          5 table' 21innodb_spin_wait_delay:6, innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10' 0pin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'>

kecho\innodb_spin_wait_delay:0, innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10
%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🐯 ~/mysql_test/tps @ann🐣 
$> =eecho 'tab   innodb_spin_wait_delay:0, innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'compare the number of tables[1,2,5,10]'                                                  use 10 table'                          compare the number of tables[1,2,5,10]'innodb_spin_wait_delay:0, innodb_spin_wait_pause_multiplier:5, innodb_sync_spin_loops:10'                                                                                         use 1 table'>

kecho\use 1 table
%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🐪 ~/mysql_test/tps @ann🐒 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \

    --mysql-host=127.0.0.1 \

    --mysql-port=3306 \

    --mysql-user=root \

    --mysql-password=password \

    --mysql-db=sbtest \

    --tables=10 \

    --table_size=100000 \

    --threads=32 \

    --time=60 \

    --rand-type=pareto \

    run
 \ >

ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            376404
        write:                           106928
        other:                           53536
        total:                           536868
    transactions:                        26650  (443.80 per sec.)
    queries:                             536868 (8940.49 per sec.)
    ignored errors:                      236    (3.93 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0469s
    total number of events:              26650

Latency (ms):
         min:                                    5.01
         avg:                                   72.07
         max:                                  334.05
         95th percentile:                      150.29
         sum:                              1920675.87

Threads fairness:
    events (avg/stddev):           832.8125/23.30
    execution time (avg/stddev):   60.0211/0.01

%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🦉 ~/mysql_test/tps @ann🐨 
$> =eecho 'use 2 table'>

kecho\use 2 table
%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🦁 ~/mysql_test/tps @ann🦊 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \

    --mysql-host=127.0.0.1 \

    --mysql-port=3306 \

    --mysql-user=root \

    --mysql-password=password \

    --mysql-db=sbtest \

    --tables=1 \

    --table_size=100000 \

    --threads=32 \

    --time=60 \

    --rand-type=pareto \

    run
 \ 2 \>

ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            383362
        write:                           109105
        other:                           54600
        total:                           547067
    transactions:                        27217  (453.26 per sec.)
    queries:                             547067 (9110.68 per sec.)
    ignored errors:                      166    (2.76 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0444s
    total number of events:              27217

Latency (ms):
         min:                                    6.40
         avg:                                   70.57
         max:                                  407.38
         95th percentile:                      167.44
         sum:                              1920678.13

Threads fairness:
    events (avg/stddev):           850.5312/18.49
    execution time (avg/stddev):   60.0212/0.01

%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🐺 ~/mysql_test/tps @ann🐰 
$> =eecho 'use 5 table'>

kecho\use 5 table
%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🐶 ~/mysql_test/tps @ann🦙 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \

    --mysql-host=127.0.0.1 \

    --mysql-port=3306 \

    --mysql-user=root \

    --mysql-password=password \

    --mysql-db=sbtest \

    --tables=2 \

    --table_size=100000 \

    --threads=32 \

    --time=60 \

    --rand-type=pareto \

    run
 \ 5 \>

ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            379764
        write:                           108338
        other:                           54187
        total:                           542289
    transactions:                        27061  (450.60 per sec.)
    queries:                             542289 (9029.86 per sec.)
    ignored errors:                      65     (1.08 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0526s
    total number of events:              27061

Latency (ms):
         min:                                   20.51
         avg:                                   70.98
         max:                                  221.56
         95th percentile:                      110.66
         sum:                              1920868.30

Threads fairness:
    events (avg/stddev):           845.6562/5.87
    execution time (avg/stddev):   60.0271/0.01

%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🐴 ~/mysql_test/tps @ann🐐 
$> =eecho 'use 1- 0 table'>

kecho\use 10 table
%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🐶 ~/mysql_test/tps @ann🐶 
$> =ttaskset -c 1-7,9-15 sysbench oltp_read_write \

    --mysql-host=127.0.0.1 \

    --mysql-port=3306 \

    --mysql-user=root \

    --mysql-password=password \

    --mysql-db=sbtest \

    --tables=5 \

    --table_size=100000 \

    --threads=32 \

    --time=60 \

    --rand-type=pareto \

    run
 \ 1 \0 \>

ktaskset\sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            366590
        write:                           104697
        other:                           52354
        total:                           523641
    transactions:                        26169  (435.61 per sec.)
    queries:                             523641 (8716.62 per sec.)
    ignored errors:                      16     (0.27 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0714s
    total number of events:              26169

Latency (ms):
         min:                                   25.69
         avg:                                   73.42
         max:                                  179.14
         95th percentile:                       92.42
         sum:                              1921294.68

Threads fairness:
    events (avg/stddev):           817.7812/4.42
    execution time (avg/stddev):   60.0405/0.02

%                                                                                                                                                                                                                                    
 
k..ysql_test/tps\
🦔 ~/mysql_test/tps @ann🐣 
$> =eexit>

kexit\
Script done on 2026-02-20 16:33:21+09:00 [COMMAND_EXIT_CODE="0"]